# Install CLI commands
brew "zsh"
brew "rbenv"
brew "autojump"
brew "yarn"
brew "fnm" # Node package manager
brew "diff-so-fancy"
brew "shellcheck"
brew "ts-node"

# LiveRamp Specific
brew "kubectl"
brew "tfenv"
brew "vault"
brew "mysql@5.7"
brew "openssl@1.1"

# Install UI applications
cask_args appdir: "/Applications"
cask "hammerspoon"
cask "1password"
cask "insomnia"
cask "fork"
cask "visual-studio-code"
cask "docker"
cask "google-cloud-sdk"
cask "meetingbar"

# Install Fonts
# cask "homebrew/cask-fonts/font-source-code-pro"
